       IDENTIFICATION DIVISION.
       PROGRAM-ID. BORDER-BOT.
       
       PROCEDURE DIVISION.
           DISPLAY "└" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "┘".
       GOBACK.
              