       IDENTIFICATION DIVISION.
       PROGRAM-ID. BORDER-TOP.
       
       PROCEDURE DIVISION.
           DISPLAY "┌" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "─────────" WITH NO ADVANCING.
           DISPLAY "┐".
       GOBACK.
              