       IDENTIFICATION DIVISION.
       PROGRAM-ID. BORDER-EMPTY.
       
       PROCEDURE DIVISION.
           DISPLAY "│                                        "
           "                       │".
       GOBACK.
              