       IDENTIFICATION DIVISION.
       PROGRAM-ID. TIMECARD.
       AUTHOR. theluqmn.com.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TP-STR-A PIC X(32).

       PROCEDURE DIVISION.
       DISPLAY ""
       STOP RUN.
       END PROGRAM TIMECARD.